<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"78fd08ae6c218017b54a61f42948fcd89e73c161bda614420962599799f29258","plan_job_ref":"Job Terraform #58 at https://github.com/ahmedqazi444/aws-assessment/actions/runs/22881503534","plan_out_hash":"d64c1b457bbb07ab96c6d97233be9fd6730398dec09ea334159f3169b5aa1c48","plan_hash":"2e2fe94980f521f7185a2025ef440f74e52cf7efb267e0307bba02023c4845d2","plan_text_format":"diff","version":"2.2.3"} -->
Terraform plan in __environments/dev__<details open><summary>With variables</summary>

```hcl
send_sns      = true
sns_topic_arn = "arn:aws:sns:us-east-1:003767002475:unleash-test-topic"
```
</details>
<details>
<summary>Plan: 12 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.compute_eu_west_1.aws_api_gateway_account.main will be created
+   resource "aws_api_gateway_account" "main" {
+       api_key_version     = (known after apply)
+       cloudwatch_role_arn = (known after apply)
+       features            = (known after apply)
+       id                  = (known after apply)
+       region              = "eu-west-1"
+       throttle_settings   = (known after apply)
    }

  # module.compute_eu_west_1.aws_api_gateway_method_settings.all will be created
+   resource "aws_api_gateway_method_settings" "all" {
+       id          = (known after apply)
+       method_path = "*/*"
+       region      = "eu-west-1"
+       rest_api_id = "**********"
+       stage_name  = "prod"

+       settings {
+           cache_data_encrypted                       = (known after apply)
+           cache_ttl_in_seconds                       = (known after apply)
+           caching_enabled                            = (known after apply)
+           data_trace_enabled                         = false
+           logging_level                              = "INFO"
+           metrics_enabled                            = true
+           require_authorization_for_cache_control    = (known after apply)
+           throttling_burst_limit                     = 1000
+           throttling_rate_limit                      = 500
+           unauthorized_cache_control_header_strategy = (known after apply)
        }
    }

  # module.compute_eu_west_1.aws_api_gateway_stage.prod is tainted, so must be replaced
-/+ resource "aws_api_gateway_stage" "prod" {
!~      arn                   = "arn:aws:apigateway:eu-west-1::/restapis/y1fs2pkgfd/stages/prod" -> (known after apply)
-       cache_cluster_enabled = false -> null
!~      execution_arn         = "arn:aws:execute-api:eu-west-1:003767002475:y1fs2pkgfd/prod" -> (known after apply)
!~      id                    = "*******************" -> (known after apply)
!~      invoke_url            = "https://y1fs2pkgfd.execute-api.eu-west-1.amazonaws.com/prod" -> (known after apply)
        tags                  = {
            "Environment" = "dev"
            "ManagedBy"   = "terraform"
            "Owner"       = "ahmed_qazi444"
            "Project"     = "unleash"
        }
-       variables             = {} -> null
+       web_acl_arn           = (known after apply)
#        (10 unchanged attributes hidden)

+       access_log_settings {
+           destination_arn = "arn:aws:logs:eu-west-1:003767002475:log-group:/aws/apigateway/unleash-eu-west-1-api"
+           format          = jsonencode(
                {
+                   httpMethod     = "$context.httpMethod"
+                   ip             = "$context.identity.sourceIp"
+                   requestId      = "$context.requestId"
+                   requestTime    = "$context.requestTime"
+                   resourcePath   = "$context.resourcePath"
+                   responseLength = "$context.responseLength"
+                   status         = "$context.status"
                }
            )
        }
    }

  # module.compute_eu_west_1.aws_iam_role.api_gateway_cloudwatch will be created
+   resource "aws_iam_role" "api_gateway_cloudwatch" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRole"
+                       Effect    = "Allow"
+                       Principal = {
+                           Service = "apigateway.amazonaws.com"
                        }
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       force_detach_policies = false
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = "unleash-eu-west-1-apigw-cloudwatch"
+       name_prefix           = (known after apply)
+       path                  = "/"
+       tags                  = {
+           "Environment" = "dev"
+           "ManagedBy"   = "terraform"
+           "Owner"       = "ahmed_qazi444"
+           "Project"     = "unleash"
        }
+       tags_all              = {
+           "Environment" = "dev"
+           "ManagedBy"   = "terraform"
+           "Owner"       = "ahmed_qazi444"
+           "Project"     = "unleash"
        }
+       unique_id             = (known after apply)

+       inline_policy (known after apply)
    }

  # module.compute_eu_west_1.aws_iam_role_policy_attachment.api_gateway_cloudwatch will be created
+   resource "aws_iam_role_policy_attachment" "api_gateway_cloudwatch" {
+       id         = (known after apply)
+       policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonAPIGatewayPushToCloudWatchLogs"
+       role       = "unleash-eu-west-1-apigw-cloudwatch"
    }

  # module.compute_us_east_1.aws_api_gateway_account.main will be created
+   resource "aws_api_gateway_account" "main" {
+       api_key_version     = (known after apply)
+       cloudwatch_role_arn = (known after apply)
+       features            = (known after apply)
+       id                  = (known after apply)
+       region              = "us-east-1"
+       throttle_settings   = (known after apply)
    }

  # module.compute_us_east_1.aws_api_gateway_method_settings.all will be created
+   resource "aws_api_gateway_method_settings" "all" {
+       id          = (known after apply)
+       method_path = "*/*"
+       region      = "us-east-1"
+       rest_api_id = "**********"
+       stage_name  = "prod"

+       settings {
+           cache_data_encrypted                       = (known after apply)
+           cache_ttl_in_seconds                       = (known after apply)
+           caching_enabled                            = (known after apply)
+           data_trace_enabled                         = false
+           logging_level                              = "INFO"
+           metrics_enabled                            = true
+           require_authorization_for_cache_control    = (known after apply)
+           throttling_burst_limit                     = 1000
+           throttling_rate_limit                      = 500
+           unauthorized_cache_control_header_strategy = (known after apply)
        }
    }

  # module.compute_us_east_1.aws_api_gateway_stage.prod is tainted, so must be replaced
-/+ resource "aws_api_gateway_stage" "prod" {
!~      arn                   = "arn:aws:apigateway:us-east-1::/restapis/rrl3lglgo6/stages/prod" -> (known after apply)
-       cache_cluster_enabled = false -> null
!~      execution_arn         = "arn:aws:execute-api:us-east-1:003767002475:rrl3lglgo6/prod" -> (known after apply)
!~      id                    = "*******************" -> (known after apply)
!~      invoke_url            = "https://rrl3lglgo6.execute-api.us-east-1.amazonaws.com/prod" -> (known after apply)
        tags                  = {
            "Environment" = "dev"
            "ManagedBy"   = "terraform"
            "Owner"       = "ahmed_qazi444"
            "Project"     = "unleash"
        }
-       variables             = {} -> null
+       web_acl_arn           = (known after apply)
#        (10 unchanged attributes hidden)

+       access_log_settings {
+           destination_arn = "arn:aws:logs:us-east-1:003767002475:log-group:/aws/apigateway/unleash-us-east-1-api"
+           format          = jsonencode(
                {
+                   httpMethod     = "$context.httpMethod"
+                   ip             = "$context.identity.sourceIp"
+                   requestId      = "$context.requestId"
+                   requestTime    = "$context.requestTime"
+                   resourcePath   = "$context.resourcePath"
+                   responseLength = "$context.responseLength"
+                   status         = "$context.status"
                }
            )
        }
    }

  # module.compute_us_east_1.aws_iam_role.api_gateway_cloudwatch will be created
+   resource "aws_iam_role" "api_gateway_cloudwatch" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRole"
+                       Effect    = "Allow"
+                       Principal = {
+                           Service = "apigateway.amazonaws.com"
                        }
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       force_detach_policies = false
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = "unleash-us-east-1-apigw-cloudwatch"
+       name_prefix           = (known after apply)
+       path                  = "/"
+       tags                  = {
+           "Environment" = "dev"
+           "ManagedBy"   = "terraform"
+           "Owner"       = "ahmed_qazi444"
+           "Project"     = "unleash"
        }
+       tags_all              = {
+           "Environment" = "dev"
+           "ManagedBy"   = "terraform"
+           "Owner"       = "ahmed_qazi444"
+           "Project"     = "unleash"
        }
+       unique_id             = (known after apply)

+       inline_policy (known after apply)
    }

  # module.compute_us_east_1.aws_iam_role_policy_attachment.api_gateway_cloudwatch will be created
+   resource "aws_iam_role_policy_attachment" "api_gateway_cloudwatch" {
+       id         = (known after apply)
+       policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonAPIGatewayPushToCloudWatchLogs"
+       role       = "unleash-us-east-1-apigw-cloudwatch"
    }

  # module.compute_eu_west_1.module.cloudfront.aws_cloudfront_distribution.this[0] will be created
+   resource "aws_cloudfront_distribution" "this" {
+       arn                             = (known after apply)
+       caller_reference                = (known after apply)
+       comment                         = "unleash-eu-west-1-api"
+       continuous_deployment_policy_id = (known after apply)
+       domain_name                     = (known after apply)
+       enabled                         = true
+       etag                            = (known after apply)
+       hosted_zone_id                  = (known after apply)
+       http_version                    = "http2"
+       id                              = (known after apply)
+       in_progress_validation_batches  = (known after apply)
+       is_ipv6_enabled                 = true
+       last_modified_time              = (known after apply)
+       logging_v1_enabled              = (known after apply)
+       price_class                     = "PriceClass_100"
+       retain_on_delete                = false
+       staging                         = false
+       status                          = (known after apply)
+       tags                            = {
+           "Environment" = "dev"
+           "ManagedBy"   = "terraform"
+           "Owner"       = "ahmed_qazi444"
+           "Project"     = "unleash"
        }
+       tags_all                        = {
+           "Environment" = "dev"
+           "ManagedBy"   = "terraform"
+           "Owner"       = "ahmed_qazi444"
+           "Project"     = "unleash"
        }
+       trusted_key_groups              = (known after apply)
+       trusted_signers                 = (known after apply)
+       wait_for_deployment             = false
+       web_acl_id                      = "**************************************************************************************************************"

+       default_cache_behavior {
+           allowed_methods          = [
+               "DELETE",
+               "GET",
+               "HEAD",
+               "OPTIONS",
+               "PATCH",
+               "POST",
+               "PUT",
            ]
+           cache_policy_id          = "************************************"
+           cached_methods           = [
+               "GET",
+               "HEAD",
            ]
+           compress                 = true
+           default_ttl              = (known after apply)
+           max_ttl                  = (known after apply)
+           min_ttl                  = 0
+           origin_request_policy_id = "************************************"
+           target_origin_id         = "***********"
+           trusted_key_groups       = (known after apply)
+           trusted_signers          = (known after apply)
+           viewer_protocol_policy   = "redirect-to-https"

+           grpc_config (known after apply)
        }

+       origin {
+           connection_attempts         = 3
+           connection_timeout          = 10
+           domain_name                 = "y1fs2pkgfd.execute-api.eu-west-1.amazonaws.com"
+           origin_id                   = "***********"
+           origin_path                 = "/prod"
+           response_completion_timeout = (known after apply)
#            (1 unchanged attribute hidden)

+           custom_origin_config {
+               http_port                = 80
+               https_port               = 443
+               origin_keepalive_timeout = 5
+               origin_protocol_policy   = "https-only"
+               origin_read_timeout      = 30
+               origin_ssl_protocols     = [
+                   "TLSv1.2",
                ]
#                (1 unchanged attribute hidden)
            }
        }

+       restrictions {
+           geo_restriction {
+               locations        = (known after apply)
+               restriction_type = "none"
            }
        }

+       viewer_certificate {
+           cloudfront_default_certificate = true
+           minimum_protocol_version       = "TLSv1.2_2025"
        }
    }

  # module.compute_us_east_1.module.cloudfront.aws_cloudfront_distribution.this[0] will be created
+   resource "aws_cloudfront_distribution" "this" {
+       arn                             = (known after apply)
+       caller_reference                = (known after apply)
+       comment                         = "unleash-us-east-1-api"
+       continuous_deployment_policy_id = (known after apply)
+       domain_name                     = (known after apply)
+       enabled                         = true
+       etag                            = (known after apply)
+       hosted_zone_id                  = (known after apply)
+       http_version                    = "http2"
+       id                              = (known after apply)
+       in_progress_validation_batches  = (known after apply)
+       is_ipv6_enabled                 = true
+       last_modified_time              = (known after apply)
+       logging_v1_enabled              = (known after apply)
+       price_class                     = "PriceClass_100"
+       retain_on_delete                = false
+       staging                         = false
+       status                          = (known after apply)
+       tags                            = {
+           "Environment" = "dev"
+           "ManagedBy"   = "terraform"
+           "Owner"       = "ahmed_qazi444"
+           "Project"     = "unleash"
        }
+       tags_all                        = {
+           "Environment" = "dev"
+           "ManagedBy"   = "terraform"
+           "Owner"       = "ahmed_qazi444"
+           "Project"     = "unleash"
        }
+       trusted_key_groups              = (known after apply)
+       trusted_signers                 = (known after apply)
+       wait_for_deployment             = false
+       web_acl_id                      = "**************************************************************************************************************"

+       default_cache_behavior {
+           allowed_methods          = [
+               "DELETE",
+               "GET",
+               "HEAD",
+               "OPTIONS",
+               "PATCH",
+               "POST",
+               "PUT",
            ]
+           cache_policy_id          = "************************************"
+           cached_methods           = [
+               "GET",
+               "HEAD",
            ]
+           compress                 = true
+           default_ttl              = (known after apply)
+           max_ttl                  = (known after apply)
+           min_ttl                  = 0
+           origin_request_policy_id = "************************************"
+           target_origin_id         = "***********"
+           trusted_key_groups       = (known after apply)
+           trusted_signers          = (known after apply)
+           viewer_protocol_policy   = "redirect-to-https"

+           grpc_config (known after apply)
        }

+       origin {
+           connection_attempts         = 3
+           connection_timeout          = 10
+           domain_name                 = "rrl3lglgo6.execute-api.us-east-1.amazonaws.com"
+           origin_id                   = "***********"
+           origin_path                 = "/prod"
+           response_completion_timeout = (known after apply)
#            (1 unchanged attribute hidden)

+           custom_origin_config {
+               http_port                = 80
+               https_port               = 443
+               origin_keepalive_timeout = 5
+               origin_protocol_policy   = "https-only"
+               origin_read_timeout      = 30
+               origin_ssl_protocols     = [
+                   "TLSv1.2",
                ]
#                (1 unchanged attribute hidden)
            }
        }

+       restrictions {
+           geo_restriction {
+               locations        = (known after apply)
+               restriction_type = "none"
            }
        }

+       viewer_certificate {
+           cloudfront_default_certificate = true
+           minimum_protocol_version       = "TLSv1.2_2025"
        }
    }

Plan: 12 to add, 0 to change, 2 to destroy.

Changes to Outputs:
+   api_gateway_urls     = {
+       eu-west-1 = (known after apply)
+       us-east-1 = (known after apply)
    }
+   cloudfront_urls      = {
+       eu-west-1 = (known after apply)
+       us-east-1 = (known after apply)
    }
+   test_config          = {
+       api_urls    = {
+           eu-west-1 = (known after apply)
+           us-east-1 = (known after apply)
        }
+       cognito     = {
+           client_id    = "**************************"
+           region       = "us-east-1"
+           user_pool_id = "*******************"
        }
+       secret_name = "unleash-cognito-test-password"
+       test_user   = "ahmed_qazi444@hotmail.com"
    }
```
</details>

:memo: Plan generated in [Terraform #58](https://github.com/ahmedqazi444/aws-assessment/actions/runs/22881503534)